Revit 2024 API
TableSectionData.GetCellParamId Method (Int32)
 Returns a column's ParamId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementId GetCellParamId(
	int nCol
)
Visual Basic
Public Function GetCellParamId ( _
	nCol As Integer _
) As ElementId
Visual C++
public:
ElementId^ GetCellParamId(
	int nCol
)
Parameters
nCol
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given column number nCol is invalid.
See Also
TableSectionData Class
GetCellParamId Overload
Autodesk.Revit.DB Namespace